// void main() {
//   /*
//   M1. 더 큰수 판별하기
// 기능:
// A, B 두 정수 중 더 큰 수를 출력
// A, B가 같다면 ‘eq’를 출력
// 미션:
// 1. 10, 20 중 더 큰수를 출력
// 2. 10,10은 ‘eq’ 출력
// 출력예시:
// 20
// eq
//    */
//   // int A = 10;
//   // int B = 20;
//   // if (A < B) {
//   //   print(B);
//   // } else if (A > B) {
//   //   print(A);
//   // } else (A == B) {
//   //   print("eq");
//   // }
//
// /*
// 설명:
//   N, M 두 정수가 짝수와 홀수의 쌍이면 “YES”, 그렇지 않으면 “NO”를 출력합니다.
//   미션:
//   1. 30, 15 일 때
//   2. 12, 40 일 때
//
//   출력예시:
//   YES
//   NO
//  */
//   int N = 12;
//   int M = 40;
//   if (N % 2 == 0 && M % 3 == 0) {
//     print("Yes");
//   } else if (N % 2 == 0 && M % 2 == 0) {
//     print("No");
//   }
//
//   /*
//   미션:
// - ‘모두연’ , ‘010’, ‘1234’, ‘5678’ 을 한줄로 만들어 보시요
//
// 출력예시:
// 모두연 010-1234-5678
//    */
//
// //   String A = "모두연";
// //   String B = "010";
// //   String C = "1234";
// //   String D = "5678";
// // phoneNumber phone = phoneNumber(B, C, D);
// //
// //   print("$A $phone");
// // }
// // class phoneNumber{
// //   String B;
// //   String C;
// //   String D;
// //
// //   phoneNumber(this.B,this.C,this.D){
// //     print("$B-$C-$D");
// //   }
//
// /*
// 설명:
// - 등차수열이란?
// 5 8 11 14 17 20 23 26 29 32
// 첫번째 숫자가 5에서 3 씩 증가 해가는 것을 알 수 있습니다.
// 일반적으로 이것을 첫항이 5, 공차가 3인 등차수열이라고 합니다.
// 이런 수열을 출력하는 프로그램을 만들어 보자.
//
// 미션:
// - 첫 항 5, 공차 10인 등차수열을 10번째까지 출력 해 보세요
//
// 출력예시:
// 5 15 25 35 45 55 65 75 85 95
//  */
// // int i = 1;
// // for(i = 1;i<=95;i++){
// //
// // }
// }